# Step 01: Regression

In [1]:
import pandas as pd
df1 = pd.read_csv('weight-height.csv')
df1.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [2]:
df2 = df1.copy()
df3 = df1.copy()
df4 = df1.copy()

In [3]:
df1.isnull().sum()

Gender    0
Height    0
Weight    0
dtype: int64

2. Separate x(Gender, Height) and y (y=Weight)
3. Train = 70%, Test = 30%
4. Apply Linear Regression
5. Evaluate the Model (Testing and training Accuracy, MSE for testing)
6. Apply KNN Regressor: https://scikit-learn.org/stable/modules/generated/sklearn.neighbors.KNeighborsRegressor.html
7. Evaluate the Model (Testing and training Accuracy, MSE for testing)
8. Compare KNN & Linear regression with the KNN model and Linear regression as well.

Work from here..

In [4]:
df1['Gender']= df1['Gender'].replace(['Male', 'Female'], [0,1])

In [5]:
df1.head()

   Gender     Height      Weight
0       0  73.847017  241.893563
1       0  68.781904  162.310473
2       0  74.110105  212.740856
3       0  71.730978  220.042470
4       0  69.881796  206.349801

In [6]:
x = df1.drop(['Weight'], axis=1) #divide the dataset

In [7]:
x.head()

   Gender     Height
0       0  73.847017
1       0  68.781904
2       0  74.110105
3       0  71.730978
4       0  69.881796

In [8]:
y = df1[['Weight']]

In [9]:
y.head()

       Weight
0  241.893563
1  162.310473
2  212.740856
3  220.042470
4  206.349801

In [10]:
df1.head()

   Gender     Height      Weight
0       0  73.847017  241.893563
1       0  68.781904  162.310473
2       0  74.110105  212.740856
3       0  71.730978  220.042470
4       0  69.881796  206.349801

In [11]:
df1.head()

   Gender     Height      Weight
0       0  73.847017  241.893563
1       0  68.781904  162.310473
2       0  74.110105  212.740856
3       0  71.730978  220.042470
4       0  69.881796  206.349801

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
xtrain,xtest,ytrain,ytest= train_test_split(x,y, test_size=.30, random_state=10)

In [14]:
xtrain.head()

      Gender     Height
1401       0  64.125697
7738       1  62.021163
3354       0  68.087904
4040       0  66.988129
3301       0  69.940973

In [15]:
ytrain.head()

          Weight
1401  157.663617
7738  136.013539
3354  170.125245
4040  176.198725
3301  180.473458

In [16]:
from sklearn.linear_model import LinearRegression

In [17]:
le = LinearRegression()
le

LinearRegression()

In [18]:
le.fit(xtrain,ytrain)

LinearRegression()

In [19]:
ytest.head()

          Weight
63    164.943303
5445  128.493024
4225  195.251666
7051  116.764230
6338  150.016876

In [20]:
pred = le.predict(xtest)

In [21]:
from sklearn.metrics import mean_squared_error,mean_absolute_error

In [22]:
mse = mean_squared_error(ytest,pred)
mse

103.00809901672962

In [23]:
mae = mean_absolute_error(ytest, le.predict(xtest))
mae

8.11008871493532

In [24]:
le.score(xtest,ytest)

0.900634758450988

In [25]:
le.score(xtrain,ytrain)

0.8996400108903837

In [26]:
xtrain.head()

      Gender     Height
1401       0  64.125697
7738       1  62.021163
3354       0  68.087904
4040       0  66.988129
3301       0  69.940973

# linear regrssion after scaling

In [70]:
df4.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [71]:
from sklearn.preprocessing import MinMaxScaler

In [73]:
mn = MinMaxScaler()
mn

MinMaxScaler()

In [74]:
df4.Height = minmax.fit_transform(df4[['Height']])

In [75]:
df4.Weight = minmax.fit_transform(df4[['Weight']])

In [78]:
df4.Gender = df4.Gender.replace(['Male','Female'],[0,1])

In [79]:
df4.head()

   Gender    Height    Weight
0       0  0.744399  0.862415
1       0  0.548328  0.472703
2       0  0.754583  0.719657
3       0  0.662487  0.755412
4       0  0.590905  0.688360

In [83]:
x3 = df4.drop(['Weight'], axis=1) #divide the dataset

In [84]:
y3 = df4[['Weight']]

In [85]:
y3.head()

     Weight
0  0.862415
1  0.472703
2  0.719657
3  0.755412
4  0.688360

In [86]:
x3.head()

   Gender    Height
0       0  0.744399
1       0  0.548328
2       0  0.754583
3       0  0.662487
4       0  0.590905

In [87]:
x3train,x3test,y3train,y3test= train_test_split(x3,y3, test_size=.30, random_state=10)

In [88]:
x3train.head()

      Gender    Height
1401       0  0.368087
7738       1  0.286620
3354       0  0.521464
4040       0  0.478891
3301       0  0.593196

In [89]:
new_le = LinearRegression()
new_le

LinearRegression()

In [99]:
new_le.fit(x3train,y3train)

LinearRegression()

In [100]:
pred = new_le.predict(x3test)

In [101]:
from sklearn.metrics import mean_squared_error,mean_absolute_error

In [102]:
new_mse = mean_squared_error(y3test,pred)
new_mse

0.002470123367971555

In [103]:
mae = mean_absolute_error(y3test, new_le.predict(x3test))
mae

0.039714512946775256

In [105]:
new_le.score(x3test,y3test) #test result after scaling liner regression

0.900634758450988

In [106]:
new_le.score(x3train,y3train)

0.8996400108903837

# KNN

In [27]:
from sklearn.neighbors import KNeighborsRegressor

In [28]:
kr = KNeighborsRegressor(n_neighbors=15)

In [29]:
kr.fit(xtrain,ytrain)

KNeighborsRegressor(n_neighbors=15)

In [30]:
ytest.head()

          Weight
63    164.943303
5445  128.493024
4225  195.251666
7051  116.764230
6338  150.016876

In [31]:
kr.predict(xtest)

array([[176.71898335],
       [124.98082517],
       [197.6571707 ],
       ...,
       [191.78125609],
       [196.83623615],
       [202.18271199]])

In [32]:
kr.score(xtest,ytest)

0.8939258991776948

In [33]:
kr.score(xtrain,ytrain)

0.9053165781651094

In [34]:
pred1 = kr.predict(xtest)

In [35]:
mse = mean_squared_error(ytest,pred1)
mse

109.96291369376952

In [36]:
le.score(xtest,ytest) #linerar regression test score

0.900634758450988

In [37]:
kr.score(xtest,ytest) #KNeighborsRegressor test score

0.8939258991776948

# Step 02: Classification

In [38]:
df2.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

2. Separate x and (y=Gender)
3. Train = 70%, Test = 30%
4. Apply KNN Classifier 
5. Evaluate the Model by only Accuracy.
6. Apply KNN Classifier: https://scikit-learn.org/stable/modules/generated/sklearn.neighbors.KNeighborsClassifier.html

Work from here..

In [39]:
df2.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [40]:
m = df2.drop('Gender',axis=1)

In [41]:
n = df2[['Gender']]

In [42]:
m.head()

      Height      Weight
0  73.847017  241.893563
1  68.781904  162.310473
2  74.110105  212.740856
3  71.730978  220.042470
4  69.881796  206.349801

In [43]:
n.head()

  Gender
0   Male
1   Male
2   Male
3   Male
4   Male

In [44]:
mtrain, mtest, ntrain,ntest = train_test_split(m,n,train_size=.80, random_state=1 )

In [45]:
from sklearn.neighbors import KNeighborsClassifier

In [46]:
kc = KNeighborsClassifier(n_neighbors=15)

In [47]:
kc.fit(mtrain,ntrain)

C:\Users\Admin\anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:198: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return self._fit(X, y)

KNeighborsClassifier(n_neighbors=15)

In [48]:
kc.predict(mtest)

array(['Male', 'Male', 'Male', ..., 'Male', 'Female', 'Female'],
      dtype=object)

In [49]:
ntest.head()

      Gender
7154  Female
3258    Male
2188    Male
5609  Female
3186    Male

In [50]:
kc.score(mtest,ntest)

0.9257744009351256

# after scalling

In [51]:
df3.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [52]:
from sklearn.preprocessing import MinMaxScaler

In [53]:
minmax = MinMaxScaler()

In [54]:
df3.Height = minmax.fit_transform(df3[['Height']])

In [55]:
df3.Weight = minmax.fit_transform(df3[['Weight']])

In [56]:
df3.head()

  Gender    Height    Weight
0   Male  0.744399  0.862415
1   Male  0.548328  0.472703
2   Male  0.754583  0.719657
3   Male  0.662487  0.755412
4   Male  0.590905  0.688360

In [57]:
x1 = df3.drop('Gender', axis=1)

In [58]:
x1.head()

     Height    Weight
0  0.744399  0.862415
1  0.548328  0.472703
2  0.754583  0.719657
3  0.662487  0.755412
4  0.590905  0.688360

In [59]:
y1 = df2[['Gender']]
y1.head()

  Gender
0   Male
1   Male
2   Male
3   Male
4   Male

In [60]:
x1train,x1test,y1train,y1test = train_test_split(x1,y1,test_size=.30,random_state=1)

In [61]:
kc_new = KNeighborsClassifier(n_neighbors=15)

In [62]:
kc_new.fit(x1train,y1train)

C:\Users\Admin\anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:198: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return self._fit(X, y)

KNeighborsClassifier(n_neighbors=15)

In [63]:
x1train.head()

        Height    Weight
1277  0.687816  0.604210
5361  0.245548  0.289393
5728  0.561389  0.504797
4276  0.528553  0.524761
3112  0.401598  0.385736

In [64]:
x1test.head()

        Height    Weight
7154  0.404565  0.465310
3258  0.627403  0.581445
2188  0.543749  0.580202
5609  0.440161  0.494904
3186  0.630376  0.659549

In [65]:
y1test.head()

      Gender
7154  Female
3258    Male
2188    Male
5609  Female
3186    Male

In [66]:
y1train.head()

      Gender
1277    Male
5361  Female
5728  Female
4276    Male
3112    Male

In [67]:
kc_new.score(x1test,y1test)# after scalling the test result of Kclassifier

0.9209193611219322

In [68]:
kc.score(mtest,ntest)# before saclling the test result Kclassifier

0.9257744009351256

In [107]:
new_le.score(x3test,y3test)  #test result after scaling liner regression

0.900634758450988

In [108]:
le.score(xtest,ytest) #test result before scaling liner regression

0.900634758450988